app/controllers/articles_controller.rb

  def update
    @article = Article.find(params[:id])
    if @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 9]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Test 3 edited"], ["description", "Description 3 edited`"], ["updated_at", "2017-08-08 10:28:25.741785"], ["id", 9]]